[
  {
    "role": "Master Thesis",
    "organization": "Human Spaceflight Technology - TUM",
    "location": "Ottobrunn, Germany",
    "start": "Feb 2025",
    "end": "Aug 2025",
    "achievements": [
      "Designed the complete electronics architecture for the Environmental Control & Life Support Systems and wearable biomedical sensors of an analog mission, from trade-off analysis, component selection, interface definition, redundancy concepts, all the way to assembly, integration, and testing (AIT).",
      "Built a low-latency telemetry pipeline that ingests ECLSS housekeeping data and wearable biomedical streams into a flight controller’s dashboard, mirroring ISS-style console practice.",
      "The system, based on CCSDS Space Packet Protocol, achieved an overall PL < 1 %, 98.152 % of the 16-day mission time with zero-Loss, and an average latency of 21.24 ms."
    ]
  },
  {
    "role": "Head of Mission Control Center",
    "organization": "Asclepios - EPFL",
    "location": "Lausanne, Switzerland",
    "start": "Jul 2024",
    "end": "Aug 2025",
    "achievements": [
      "Architected the ground segment telemetry & telecommand system using YAMCS, including XTCE-based parameter databases, command dictionaries, TM/TC packet definitions, and interface control in alignment with ECSS/CCSDS standards.",
      "Managed critical data from ECLSS and biomedical sensors, supporting medical and science teams. ",
      "Developed voice-communication software implementing DLR’s Voice Communication Subsystem (openVoCS) loop logic for mission-control operations."

    ]
  },
  {
    "role": "Avionic-Systems & GUI",
    "organization": "ESA Academy",
    "location": "Bordeaux, France",
    "start": "Jul 2025",
    "end": "Sep 2025",
    "achievements": [
      "Performed AIT of the full avionics rack, including complete verification of sensor chains, power distribution units, fuses, EMI/EMC considerations, relay boards, and electro-mechanical actuators.",
      "Designed and built a real-time flight-ops GUI that fuses 15 sensor channels telemetry, FLIR video, and live g-level classification into a single dashboard used on the A310 Novespace Zero-G aircraft.",
      "Conducted flight-readiness tests and produced detailed test reports validating the system performance."
    ]
  },
  {
    "role": "Semester Thesis: HiL Simulation Environment for Avionic systems",
    "organization": "Institute of Flight System Dynamics - TUM",
    "location": "Garching, Germany",
    "start": "Jan 2024",
    "end": "Jul 2024",
    "achievements": [
      "Development of a HiL Simulation Environment for the avionic systems of the Airbus Urban Mobility Airship using the TechSat ADS2 HiL PC.",
      "Integrated the ADS2 with a dedicated visualization PC running Microsoft Flight Simulator (MSFS) via UDP messages transmitting aircraft state according to the flight dynamic model.",
	"Successful HiL Test of the Ground Control Station communications with the Airship."
    ]
  },
  {
    "role": "Avionics Intern",
    "organization": "Centre National d’Études Spatiales (CNES)",
    "location": "Paris, France",
    "start": "May 2022",
    "end": "Aug 2022",
    "achievements": [
      "Designed and validated avionics PCB for acquisition and control in sounding rockets.",
      "Performed bench validation ensuring full system compliance with performance and EMC standards.",
      "Developed connectivity between mission control and launch pad using MQTT protocol, contributing to the nominal launch of SERA IV rocket from Kiruna, Sweden."
    ]
  }
]
