[
  {
    "title": "Hardware-In-The-Loop Simulation Environment for the Avionics Systems of an Airship",
    "slug": "airship",
    "summary": "A HiL Simulation Environment for the avionic systems of the Airbus Urban Mobility Airship using the TechSat ADS2 HiL PC was setup. The ADS2 was interfaced with a Visualization PC using the internal TCP-UDP I/O Device where a UDP message containing the Aircraft state according to the flight dynamic model is sent to Microsoft Flight Simulator. Thanks to this environment, a successful HiL Test of the Ground Control Station communications with the Airship was conducted",
    "stack": ["HIL", "UDP", "MATLAB & Simulink", "RS232", "RS485", "CAN", "A429", "RocksDB", "DOORS"],
    "highlights": [
      "Built a full HIL testing environment for an Airships Avionic systems ",
      "Enabled live visualisation off the Aircraft's state using Microsoft Flight Simulator",
      "Successfully tested the Ground Control Station communications with the Airship"
    ],
    "links": {
      "source": "https://space-solutions.airbus.com/imagery/3d-elevation-and-reference-points/3d-mapping/"
    },
    "images": [
      "/assets/projects/airship1.jpeg",
      "/assets/projects/NDA.jpeg"
    ],
    "problem": [
      "Develop a test and validation framework for the avionic systems of the Airbus Urban Mobility Airship",
      "Ensure realistic flight-dynamics visualization and reliable communication interfaces"
    ],
    "approach": [
      "Designed and implemented a Hardware-in-the-Loop (HiL) simulation environment using the TechSat ADS2 HiL PC",
      "Interfaced the ADS2 with a Visualization PC running Microsoft Flight Simulator, exchanging aircraft-state data via UDP according to the flight dynamic model",
      "Configured internal I/O devices to simulate communication links between avionics and the GCS"
    ],
    "results": [
      "Successfully validated end-to-end communication between the Ground Control Station and the Airship avionics in a real-time HiL setup",
      "Achieved synchronized visualization of dynamic flight behavior in MSFS",
      "Provided a functional HiL testbed architecture ready for integration and future development of autonomous airship control systems"
    ]
  },
  {
    "title": "Real-Time Flight-Ops GUI",
    "slug": "real-time-gui",
    "summary": "Magnetohydrodynamic Vortex‑Inducing Photobioreactor Experiment (MVIPER) tests a novel way to mix and de‑gas algal photobioreactors in weightlessness. Instead of pumps and membranes, it uses a magnetohydrodynamic (MHD) drive: electrodes impose an electric field through a conductive growth medium while permanent magnets supply a perpendicular magnetic field. The resulting Lorentz force spins the liquid into a vortex that should drive liquid outward and force gas bubbles inward for easy separation, potentially making future life‑support bioreactors simpler, lighter, and more reliable in space. The experiment was tested during the 87ᵗʰ ESA–Novespace parabolic‑flight campaign in September 2025. The GUI fuses 15 sensor channels telemetry, live video feed, and live g-level classification into a single dashboard used on the A310 Novespace Zero-G aircraft.",
    "stack": ["Teensy 4.1", "C/C++", "Python", "CCSDS", "RocksDB", "Git", "TT&C"],
    "highlights": [
      "Sustained 10 kHz sampling across multi-sensor buses",
      "Generated CRC16-wrapped frames with lossless buffering",
      "Dynamic priority packets ensured critical telemetry delivery"
    ],
    "links": {
    },
    "images": [
      "/assets/projects/MVIPER1.png",
      "/assets/projects/MVIPER2.gif",
      "/assets/projects/MVIPER3.jpg"
    ],
    "problem": [
      "The Microgravity lasts for 22 seconds in each parabola, Operators require high situational awareness during this time window",
      "The GUI should allow the operators to spot current spikes, hydrogen leaks ..."
    ],
    "approach": [
      "Designed a reception server and GUI capable of plotting prolonged periods of sensor data",
      "Implemented live video feed of the chamber scientific camera and two other operational cameras",
      "Persisted sensor readings to a local database"
    ],
    "results": [
      "All sensor data produced during three flights were correctly and redundantly stored",
      "Operators successfully conducted the experiment with high situational awareness"
    ]
  },
  {
    "title": "YAMCS based Monitoring and Control System (MCS) Software",
    "slug": "mcs",
    "summary": "In order to align with industry standards, this MCS was build using Space Application's open source software YAMCS. This all in one tool enables Flight Planning, reception and decoding of CCSDS Space Packet Protocol, following a mission specific MIB that follows the CCSDS XTCE Protocol. The Software is an easy to use Web based tool that allows Flight Controllers to view and edit the Flight Plan, monitor critical ECLSS and Biomedical data, and conduct real-time trend analysis. The software also allows the Flight Control Team to send commands, log events, and local data storage.",
    "stack": ["CCSDS", "ECSS", "YAMCS", "yaml", "Python", "TT&C"],
    "highlights": [
      "Build a Monitoring and Control System aligned with industry standards",
      "Enabled efficient flight Planing",
      "Enabled Telemetry and Command following CCSDS Protocols"
    ],
    "links": {
      "demo": "https://asclepios-mcc.org/"
    },
    "images": [
      "/assets/projects/MCS2.png",
      "/assets/projects/MCS1.jpg"
    ],
    "problem": [
      "The analog Mission lacked an industry-like MCS",
      "The FCT used multiple tools to achieve mission goals"
    ],
    "approach": [
      "Implemented CCSDS-compliant MCS based on YAMCS",
      "Trained the FCT on multiple instances on the MCS"
    ],
    "results": [
      "The FCT detected critical anomalies faster",
      "The analog mission is now more aligned with the Space industry standards"
    ]
  },
  {
    "title": "Voice Loops Communication Software",
    "slug": "analog-mission-mcc-voice-loops",
    "summary": "Modelled after the voice loop structure used in the Columbus Control Centre and in flight control centres around the world, this software allows users to listen in to up to three voice loops simultaneously. Volume can be adjusted on each loop, and they can each be toggled while speaking. Certain loops have restricted permissions to comply with operational procedures - for example, all flight controllers can listen into the Space to Ground loop, but only the CapCom, Flight Director, and astronauts in the base can speak in this loop. This new software both improved realism to match industry standards and simplified Asclepios MCC communications. Additionally, the MCC communications software implemented an artificial six-second round-trip communications delay to simulate the latency in communications between the Moon and the Earth. While this has been done previously in NASA or ESA-led analogue projects such as NEEMO and PANGAEA-X/Analog-1, Asclepios is the first non-space-agency analogue mission to implement it.",
    "stack": ["Python", "PyMumble", "Flask", "HTML", "Linux", "Git"],
    "highlights": [
      "Enabled Voice Loop Communication between Flight Controllers and Analog Crew",
      "Enabled artificial voice delay",
      "Increased situational awareness inside the MCC"
    ],
    "links": {
      "github": "https://github.com/itaame/MC-COMMS3"
    },
    "images": [
      "/assets/projects/mcc-voice-loops3.JPEG",
      "/assets/projects/mcc-voice-loops5.jpg",
      "/assets/projects/mcc-voice-loops6.PNG",
      "/assets/projects/mcc-voice-loops.png"
    ],
    "problem": [
      "Analog astronaut crews and Flight Controllers needed low-latency communications",
      "Operators were required to listen to multiple channels",
      "The mission required the implementation of artificial voice delay"
    ],
    "approach": [
      "Studied the voice communication system in Col-CC and around the world",
      "Built Flask-based voice loop router with PyMumble client orchestration"
    ],
    "results": [
      "Increased Flight Controller's situational awareness",
      "Enabled Artificial voice delay",
      "Nominally deployed in the ASCLEPIOS V and WBA Spartan Space analog space missions"
    ]
  },
  {
    "title": "Avionics systems for propulsion and control in sounding rockets",
    "slug": "cnes",
    "summary": "Developed the first prototype of a modular acquisition and control board, designed for flexibility and sensor scalability. The system supports up to nine including very low-voltage (35 mV–100 mV), 10–12 V, 0–5 V, and digital inputs. It also features control capability for four solenoid valves, operating in multiple modes (in-phase, opposite-phase, or mixed). Extensive breadboard simulations and validation tests confirmed full functionality and compliance with system requirements. Deliverables included the complete Altium project (schematic and PCB layout), Bill of Materials (BOM), and the embedded code for CAN communication and USB sensor interfacing.",
    "stack": ["Altium Designer", "Proteus", "BOM", "CAN", "PCB", "C/C++", "EMC"],
    "highlights": [
      "Developed a modular avionics board enabling scalable sensor acquisition and actuator control for rocket propulsion systems",
      "Implemented multi-mode solenoid valve control and CAN/USB communication firmware ensuring precise operation",
      "Validated full system functionality through simulations and bench tests, delivering a reusable avionics platform for future missions"
    ],
    "links": {
      "source": "https://cnes.fr/projets/perseus"
    },
    "images": [
      "/assets/projects/cnes1.png",
      "/assets/projects/cnes2.png"
    ],
    "problem": [
      "Design an avionics system capable of real-time data acquisition and control for the ASTREOS-1 supersonic bi-liquid rocket demonstrator",
      "Ensure compatibility with multiple analog and digital sensors, while maintaining modularity and electromagnetic robustness",
      "Integrate control of multiple electromechanical actuators (solenoid valves) under strict aerospace reliability constraints"
    ],
    "approach": [
      "Developed a modular acquisition and control board with six to nine scalable sensor inputs",
      "Implemented complete analog signal conditioning (amplification, filtering, isolation) and control stages using Altium Designer and Proteus simulations",
      "Produced the complete design package: schematic and PCB layout, BOM, embedded firmware, and communication interface code"
    ],
    "results": [
      "Achieved a fully functional prototype compliant with performance and integration requirements",
      "Verified full acquisition and control functionality through simulations and bench validation",
      "Delivered a reusable avionics architecture for future ASTREOS rocket iterations, supporting expanded sensor and actuator configurations"
    ]
  },
  {
    "title": "Flight Testing Lab",
    "slug": "ftl",
    "summary": "Developed a comprehensive understanding of Flight Testing Techniques, with particular emphasis on Flight Performance, Stability, and Control. The work encompassed the full process of preparing, executing, and analysing flight tests in a controlled simulator environment. This included the study of operational requirements, aviation regulations, and the specific responsibilities of the flight test crew. Detailed Flight Test Cards (FTCs) were prepared for each exercise, accompanied by the setup and use of flight test instrumentation and data acquisition systems. During a two-hour demonstration flight using a DA-42 simulator, twelve distinct test procedures were executed — including take-off performance, phugoid motion, and Dutch roll assessments. The campaign concluded with in-depth analysis and interpretation of flight test data, resulting in a strong technical foundation in both theoretical and applied flight testing.",
    "stack": ["HIL", "UDP", "MATLAB & Simulink", "RS232", "RS485", "CAN", "A429", "RocksDB"],
    "highlights": [
      "Executed a complete experimental flight test campaign on a DA-42 simulator, covering 12 performance and stability test cases",
      "Prepared professional Flight Test Cards and configured flight instrumentation in accordance with aviation standards",
      "Analyzed acquired flight data to validate aerodynamic models and assess aircraft handling qualities"
    ],
    "links": {
      "source": "https://www.fsd.ed.tum.de/teaching/pfvt/"
    },
    "images": [
      "/assets/projects/ftl1.jpg",
      "/assets/projects/ftl2.png"
    ],
    "problem": [
      "Conduct a full experimental flight test campaign to evaluate aircraft performance, stability, and control characteristics",
      "Bridge theoretical aerodynamics and flight mechanics with practical test execution and data analysis",
      "Understand regulatory, operational, and crew coordination aspects of flight test engineering"
    ],
    "approach": [
      "Prepared detailed Flight Test Cards (FTCs) following aviation test procedures and safety requirements",
      "Configured DA-42 simulator instrumentation and performed a two-hour demonstration flight covering 12 test cases",
      "Acquired and processed flight data, applying analytical methods to derive aerodynamic coefficients and assess handling qualities"
    ],
    "results": [
      "Completed a full end-to-end flight testing workflow from planning to post-flight analysis",
      "Validated theoretical models through experimental data",
      "Gained practical insight into professional flight test practices, data integrity, and pilot–engineer collaboration"
    ]
  },
  {
    "title": "Flight Control Systems Lab",
    "slug": "fcsl",
    "summary": "Acquired an in-depth understanding of aerospace development processes, avionics systems, and certification standards, with a particular focus on DO-178C and DO-331. The work concentrated on the functional implementation of flight control algorithms, evaluation of flight dynamics, and development of flight control software modules. Gained practical expertise in data transmission using the CAN-based ARINC825 standard and investigated the integration of redundant electromechanical actuators (EMAs) within modern flight control architectures. Implemented and tested flight control strategies for a demonstrator aircraft (DA-42 simulator) through both Processor-In-The-Loop (PIL) and Hardware-In-The-Loop (HIL) simulations. Additionally, developed strong analytical insight into the factors affecting flying and handling qualities, along with the ability to evaluate Pilot-In-The-Loop interactions from both theoretical and experimental perspectives.",
    "stack": ["SIL", "HIL", "PIL", "MATLAB & Simulink","Polarion", "FMAE", "EMA", "DO-178C", "DO-331", "CAN", "ARINC825"],
    "highlights": [
      "Implemented and tested DO-178C/DO-331-compliant flight control algorithms on a DA-42 simulator using PIL and HIL methods",
      "Integrated redundant electromechanical actuators and ARINC825-based CAN communication for reliable control performance",
      "Validated closed-loop stability and pilot-in-the-loop behavior across multiple flight scenarios"
    ],
    "links": {
      "source": "https://www.fsd.ed.tum.de/teaching/pfr/"
    },
    "images": [
      "/assets/projects/fcsl1.png",
      "/assets/projects/fcsl2.png"
    ],
    "problem": [
      "Develop and certify a flight control system according to aerospace safety standards",
      "Ensure reliable communication and actuator redundancy in a realistic avionics environment",
      "Understand and test the pilot’s interaction within the flight control loop"
    ],
    "approach": [
      "Implemented flight-control algorithms in MATLAB/Simulink, then deployed them to a flight control computer",
      "Established CAN-based communication via ARINC825 and integrated redundant EMAs",
      "Conducted  Software, Hardware and Pilot-in-the-Loop simulations on the DA-42 aircraft simulator"
    ],
    "results": [
      "Achieved stable closed-loop control performance under multiple flight scenarios",
      "Validated functional safety and redundancy handling in compliance with DO-178C/DO-331",
      "Gained operational insight into pilot-in-the-loop behavior and the interplay between software, hardware, and human factors"
    ]
  }
]
